tap "1password/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "trufflesecurity/trufflehog"
tap "warrensbox/tap"
tap "xwmx/taps"
brew "age"
brew "zstd"
brew "aom"
brew "autoconf"
brew "aws-iam-authenticator"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "binwalk"
brew "brogue"
brew "coreutils"
brew "dive"
brew "docker-compose"
brew "fd"
brew "icu4c@76"
brew "leptonica"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "helm"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "parallel"
brew "ripgrep"
brew "scrcpy"
brew "sops"
brew "sshuttle"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "yamllint"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zx"
brew "trufflesecurity/trufflehog/trufflehog", link: false
brew "warrensbox/tap/tfswitch"
cask "1password-cli"
cask "android-platform-tools"
cask "bruno"
cask "cameracontroller"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-hack-nerd-font"
cask "font-monaspace"
