tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "trufflesecurity/trufflehog"
tap "xwmx/taps"
brew "age"
brew "autojump"
brew "aws-iam-authenticator"
brew "awscli"
brew "coreutils"
brew "dive"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "pyenv"
brew "scrcpy"
brew "sops"
brew "sshuttle"
brew "terraform"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "trufflesecurity/trufflehog/trufflehog"
brew "xwmx/taps/nb"
cask "1password-cli"
cask "android-platform-tools"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-hack-nerd-font"
