tap "1password/tap", trusted: true
tap "anomalyco/tap", trusted: true
tap "charmbracelet/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "trufflesecurity/trufflehog", trusted: true
# Simple, modern, secure file encryption
brew "age"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Development kit for the Java programming language
brew "openjdk"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Automatic configure script builder
brew "autoconf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Toolchain of the web
brew "biome"
# Roguelike game
brew "brogue"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Device tree compiler
brew "dtc"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tunnel IPv4 traffic through a DNS server
brew "iodine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Menu-driven communications program
brew "minicom"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generic machine emulator and virtualizer
brew "qemu"
# Reverse engineering framework
brew "radare2"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Compressed read-only file system for Linux
brew "squashfs"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Simple TTY terminal I/O application
brew "tio"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Markup-based typesetting system
brew "typst"
# Universal boot loader
brew "u-boot-tools"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Additional completion definitions for zsh
brew "zsh-completions"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Terraform
brew "hashicorp/tap/terraform"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Universal game trainer
cask "bit-slicer"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Control USB Cameras from an app
cask "cameracontroller"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-hack-nerd-font"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# Multimedia player
cask "vlc"
